app/controllers/v1/books_controller.rb

SELECT "books".* FROM "books"
---
    def allbooks
      @books = Book.all

INSERT INTO "books" ("name", "author", "isbn", "number_of_pages", "cat_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "chensoh"], ["author", "nsoh"], ["isbn", "123"], ["number_of_pages", "100"], ["cat_id", 1], ["created_at", "2021-12-05 12:32:09.585996"], ["updated_at", "2021-12-05 12:32:09.585996"]]
---
    def create
      @book = Book.create!(books_params)