app/controllers/v1/cats_controller.rb

INSERT INTO "cats" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "we"], ["created_at", "2021-11-25 20:19:17.691417"], ["updated_at", "2021-11-25 20:19:17.691417"]]
---
    def create
      @cat = Cat.create!(cat_params)