app/controllers/categories_controller.rb

  def index
    @categories = Categorie.all
---
SELECT "categories".* FROM "categories"

  def create
    @categorie = Categorie.create!(categories_params)
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Dune"], ["created_at", "2021-11-01 06:07:00.628512"], ["updated_at", "2021-11-01 06:07:00.628512"]]