app/controllers/measurments_controller.rb

  def create
    @measurement = current_user.measurements.create!(measurement_params)
---
INSERT INTO "measurements" ("pages_read", "user_id", "book_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["pages_read", 24], ["user_id", 1], ["book_id", 1], ["created_at", "2021-11-03 09:15:29.384834"], ["updated_at", "2021-11-03 09:15:29.384834"]]