app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
      auth_token = AuthenticateUser.new(@user.email, @user.password).call
      response = { message: Message.account_created, auth_token: auth_token }
      json_response(response, :created)
    else
      response = @user.errors.full_messages.join(';')
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "ash@email.com"], ["LIMIT", 1]]